import { useSearchParams } from "react-router-dom";
import "./Home.css"


const greetName = [
    "यशाची रोषणाई दिपावलीच्या आजपासून ते भाऊबीज पर्यंतच्या साजरा होत असलेल्या आनंदमयी उत्साही, मंगलमय पर्वानिमित्त आपणास व ,परिवारास मनःपूर्वक हार्दिक शुभेच्छ ",

    "💥असेच दिवे जळत राहो,मनाशी मनेजुळत राहो, सुख समृद्धि दारी येवो, लक्ष्मी घरी नांदत राहो, दिवाळी च्या तुम्हा सर्वांना💥 🧨🙏खूप खूप शुभेच्छा.🙏🧨",

    "दिपावळीच्या शुभेच्छा! सस्नेह नमस्कार, दिपावळीपासून ते भाऊबीज पर्यंत,साजरा होत असलेल्या आनंदमयी,उत्साही, मंगलमय पर्वानिमित्त आपणास वआपल्या परिवारास मनःपूर्वक हार्दिक शुभेच्छ!हे नववर्ष आपणास आनंदी,भरभराटीचे, प्रगतीचे,आरोग्यदायी जाओ ह्याच मनोकामन",

    "सुखं होवोत ओव्हरफ्लो, मस्ती कधी न होवो स्लो, धन आणि समृद्धीचा होवो वर्षाव, असा होवो तुमचा दीपाळीचा सण छान.",

    "धनाची पुजा यशाचा प्रकाश किर्तीचे अभ्यंगस्नान,मनाचे लक्ष्मीपुजन संबंधाचा फराळ समृध्दीचा पाडवाप्रेमाची भाऊबीज अशा या दिपावलीच्या आपल्या सहकुटुंब,सहपरिवरास सोनेरी शुभेच्छा!!! "  
]




export default function Home() {

    const [searchParams] = useSearchParams();

    const to = searchParams.get("to");
    const from = searchParams.get("from");
    const greetNumber = searchParams.get("g")>=greetName.length ? 0 : searchParams.get("g") || 0 ;
    
    return (
        <div className="greet-card">

            <span>
                प्रिय {to}
            </span>
            <p> {greetName[greetNumber]}</p><br/>

            <span className="from-message">  आपला शुभेच्छुक 🙏🏻
                {from}</span>
        </div>
    )
}